title: Multiple Failed Logins From Single Source IP (Credential Stuffing)

id: fintech-credential-stuffing-001

status: experimental

description:
  Detects credential stuffing attempts where one source IP performs many failed logins against multiple users.

author:
  SIEM Engineer

logsource:
  product: windows
  service: security

detection:

  selection:
    EventID: 4625
    Status: "0xC000006A"

  timeframe:
    5m

  condition:
    selection | count(TargetUserName) > 20 by IpAddress


level: high

tags:
  - attack.t1110.004
