title: Suspicious OAuth Application Consent Detection


id: fintech-003


status: experimental


description:

 Detects suspicious OAuth applications requesting dangerous permissions.


author:

 SIEM Engineer


logsource:

 category:

  cloud_identity



detection:


 selection:


  event:

   - oauth_consent_granted


  permission:

   - admin
   - mail.read
   - files.read



 condition:


  selection



level:


 high



tags:


 - attack.t1098
 - account-manipulation
