title: Suspicious OAuth Application Consent

id: fintech-oauth-001

status: experimental


description:
  Detects OAuth applications requesting dangerous permissions.


author:
  SIEM Engineer


logsource:

  product: azure
  service: auditlogs


detection:


  selection:

    OperationName:
      - "Consent to application"


    Permission:

      - "Mail.ReadWrite"
      - "offline_access"
      - "Files.ReadWrite"



  condition:

    selection



level:

  high


tags:

  - attack.t1098


