title: Web Server Spawning Command Shell

id: fintech-webshell-001

status: experimental

description:
  Detects possible web shell execution when web services spawn command interpreters.

author:
  SIEM Engineer


logsource:

  product: linux
  category: process_creation


detection:

  selection:

    ParentImage:
      - apache2
      - nginx

    Image:
      - /bin/bash
      - /bin/sh


  condition:

    selection


level:

  critical


tags:

  - attack.t1505.003
